dafoam-tutorials-main/DPW4_Aircraft/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField uniform (290.82273066255685743182 0 10.15575354042778275015);

boundaryField
{
    "wing.*"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    "tail.*"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    body
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    sym
    {
        type            symmetry;
    }
    inout
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;        
    }

}


// ************************************************************************* //
